; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph2 - mode
	thermograph1 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation7 - direction
	GroundStation5 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star3)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(have_image Star8 spectrograph2)
	(have_image Phenomenon9 thermograph1)
	(have_image Star10 thermograph1)
	(have_image Planet11 thermograph1)
	(have_image Phenomenon12 thermograph0)
	(have_image Star13 thermograph1)
	(have_image Planet14 spectrograph2)
	(have_image Planet15 thermograph0)
	(have_image Phenomenon16 thermograph1)
	(have_image Star17 thermograph1)
	(have_image Phenomenon18 thermograph0)
	(have_image Phenomenon19 thermograph1)
))

)

; plan
1. (turn_to satellite0 groundstation5 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 12
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite0 phenomenon19 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon19)
   goals met: 0 of 12
5. (take_image satellite0 phenomenon19 instrument1 thermograph1)
   added: (have_image phenomenon19 thermograph1)
   goals met: 1 of 12
6. (turn_to satellite0 phenomenon18 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 phenomenon18)
   goals met: 1 of 12
7. (take_image satellite0 phenomenon18 instrument1 thermograph0)
   added: (have_image phenomenon18 thermograph0)
   goals met: 2 of 12
8. (turn_to satellite0 phenomenon16 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 12
9. (take_image satellite0 phenomenon16 instrument1 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 3 of 12
10. (turn_to satellite0 phenomenon12 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 12
11. (take_image satellite0 phenomenon12 instrument1 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 4 of 12
12. (turn_to satellite0 phenomenon9 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 12
13. (take_image satellite0 phenomenon9 instrument1 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 5 of 12
14. (turn_to satellite0 planet11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet11)
   goals met: 5 of 12
15. (take_image satellite0 planet11 instrument1 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 6 of 12
16. (turn_to satellite0 planet14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet14)
   goals met: 6 of 12
17. (take_image satellite0 planet14 instrument1 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 7 of 12
18. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 7 of 12
19. (take_image satellite0 planet15 instrument1 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 8 of 12
20. (turn_to satellite0 star10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star10)
   goals met: 8 of 12
21. (take_image satellite0 star10 instrument1 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 9 of 12
22. (turn_to satellite0 star13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star13)
   goals met: 9 of 12
23. (take_image satellite0 star13 instrument1 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 10 of 12
24. (turn_to satellite0 star17 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star17)
   goals met: 10 of 12
25. (take_image satellite0 star17 instrument1 thermograph1)
   added: (have_image star17 thermograph1)
   goals met: 11 of 12
26. (turn_to satellite0 star8 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star8)
   goals met: 11 of 12
27. (take_image satellite0 star8 instrument1 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 12 of 12
